Ran Plan for dir: `project/cosmic-surface` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.gke.google_container_cluster.primary must be replaced
-/+ resource "google_container_cluster" "primary" {
      ~ additional_zones            = [] -> (known after apply)
      ~ cluster_ipv4_cidr           = "10.48.0.0/14" -> (known after apply)
      ~ default_max_pods_per_node   = 110 -> (known after apply)
        enable_binary_authorization = false
        enable_intranode_visibility = false
        enable_kubernetes_alpha     = false
        enable_legacy_abac          = true
        enable_shielded_nodes       = false
        enable_tpu                  = false
      ~ endpoint                    = "35.234.110.174" -> (known after apply)
      ~ id                          = "projects/cosmic-surface-250108/locations/europe-west3-c/clusters/mmk8s-cluster" -> (known after apply)
        initial_node_count          = 1
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/beta/projects/cosmic-surface-250108/zones/europe-west3-c/instanceGroups/gke-mmk8s-cluster-default-node-pool-f1aff912-grp",
        ] -> (known after apply)
      ~ label_fingerprint           = "a9dc16a7" -> (known after apply)
      ~ location                    = "europe-west3-c" -> "europe-west2-c" # forces replacement
        logging_service             = "logging.googleapis.com/kubernetes"
      ~ master_version              = "1.14.10-gke.17" -> (known after apply)
        monitoring_service          = "monitoring.googleapis.com/kubernetes"
        name                        = "mmk8s-cluster"
      ~ network                     = "projects/cosmic-surface-250108/global/networks/net-network" -> "net-network"
      ~ node_locations              = [] -> (known after apply)
      ~ node_version                = "1.14.10-gke.17" -> (known after apply)
      + operation                   = (known after apply)
        project                     = "cosmic-surface-250108"
      + region                      = (known after apply)
        remove_default_node_pool    = true
      - resource_labels             = {} -> null
      ~ services_ipv4_cidr          = "10.1.0.0/20" -> (known after apply)
      ~ subnetwork                  = "projects/cosmic-surface-250108/regions/europe-west3/subnetworks/net-network" -> (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)
      + zone                        = (known after apply)

      ~ addons_config {
          + cloudrun_config {
              + disabled = (known after apply)
            }

          + horizontal_pod_autoscaling {
              + disabled = (known after apply)
            }

          + http_load_balancing {
              + disabled = (known after apply)
            }

          + istio_config {
              + auth     = (known after apply)
              + disabled = (known after apply)
            }

          + kubernetes_dashboard {
              + disabled = (known after apply)
            }

          ~ network_policy_config {
              ~ disabled = true -> (known after apply)
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      ~ cluster_autoscaling {
          ~ autoscaling_profile = "BALANCED" -> (known after apply)
          ~ enabled             = false -> (known after apply)

          + auto_provisioning_defaults {
              + oauth_scopes    = (known after apply)
              + service_account = (known after apply)
            }

          + resource_limits {
              + maximum       = (known after apply)
              + minimum       = (known after apply)
              + resource_type = (known after apply)
            }
        }

      ~ database_encryption {
          + key_name = (known after apply)
          ~ state    = "DECRYPTED" -> (known after apply)
        }

      ~ ip_allocation_policy {
          ~ cluster_ipv4_cidr_block       = "10.48.0.0/14" -> (known after apply)
          ~ cluster_secondary_range_name  = "gke-mmk8s-cluster-pods-a75c5a7a" -> (known after apply)
          + node_ipv4_cidr_block          = (known after apply)
          ~ services_ipv4_cidr_block      = "10.1.0.0/20" -> (known after apply)
          ~ services_secondary_range_name = "gke-mmk8s-cluster-services-a75c5a7a" -> (known after apply)
          + subnetwork_name               = (known after apply)
        }

      ~ master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          ~ cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURDekNDQWZPZ0F3SUJBZ0lRV0t1blhVZUVLMSsxa3dwaTI4dTkzVEFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlSaE16RXhNV1JoT0Mwek1UbGhMVFEyWm1FdE9HWTRPUzAxT1dRMllUUmhaVGxoTm1JdwpIaGNOTWpBd016QTNNVEUxT0RVeVdoY05NalV3TXpBMk1USTFPRFV5V2pBdk1TMHdLd1lEVlFRREV5UmhNekV4Ck1XUmhPQzB6TVRsaExUUTJabUV0T0dZNE9TMDFPV1EyWVRSaFpUbGhObUl3Z2dFaU1BMEdDU3FHU0liM0RRRUIKQVFVQUE0SUJEd0F3Z2dFS0FvSUJBUURGcHY4dVpCTDJSZlNtSzlmL0I5UlYyZTVrRzg3ZmQzK2VxOG4vUjZZRApPRGpUalV4SUh5MUQxVHdpSTdkUGdDRFVLekRZRVN5VkkwZWp4dXM5WXZUdDRtMGN0bHlOL3MwZ2ROVEFEVTE5CktjZ2ZrQVJFVUZqVjY4d2FBUFc0aTJ3VllkYWl2dnFaVmx0Qy9QeHB0MU1ROUgwUVFQbzZmZldnbGx0cnJZMVgKZGtQUkpML05oaUYyckFUOFJCSHl3cVBFdGxpcTR6Z2lNak1mR2xxN3RHdnJtVWpWa1J5cUJXenBRMXBxUTVJbApwMUk3ODJ5dVRFb2s1eVlJRDBiaVlseHlDejRBSWpCNXhTdDZSTnNNT20xakdyc3Y3UEpiTFBXaXh6WlJ0R2pQClNIaE5wdFRabFhFdTNNeTJnQXhWRXYxeVQrdUtYTW13ak9NMDRyamxBUzZCQWdNQkFBR2pJekFoTUE0R0ExVWQKRHdFQi93UUVBd0lDQkRBUEJnTlZIUk1CQWY4RUJUQURBUUgvTUEwR0NTcUdTSWIzRFFFQkN3VUFBNElCQVFCcQpmaWhHSFdQbDdMbllEbC96WVljeU9PYTlYWFh1eDNyNVZCUjFUalZnRGlWSTVlWDZNRWxKM2tMa3BlQTZWeHN2CjJqU092YkZ2MXJ4UnRXZHZpY3BVYWhiZmRjZUpFc2dqZllIajNGWFZCYzBQR2R4Mnp4K1FaVUMybzBkWGxNeHoKMzNLdmhkUHBMMjZUWEkrWUc0cFFoeFppQ2lzTU1NR0hjQ2xCQTBUQU5CSUQrMXpvdCtWNWVlSXR5RkhaMTFZbwpzU3Y5K05hdXF0REIyUzhTaC9kZzR6bXhseWNHL1VzVk5uSktQRmk1YUFpK09ZZFJraUtJbGVKSDhBRnlOT3dVCm9iSG1ZcCtZSlQ1QnQ1cFhNU3d2TFpzNDNCaGFLQ3N1MkpGMmI4MkliNlBmdkJJSG9zUE1aaTZwZ3ZMbTRwa0oKUXZiaC9qUHRZdkdUU09zRGRQQTYKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
          + password               = (sensitive value)
          + username               = (known after apply)

          ~ client_certificate_config {
              ~ issue_client_certificate = false -> (known after apply)
            }
        }

      ~ network_policy {
          ~ enabled  = false -> (known after apply)
          ~ provider = "PROVIDER_UNSPECIFIED" -> (known after apply)
        }

      ~ node_config {
          + boot_disk_kms_key = (known after apply)
          ~ disk_size_gb      = 100 -> (known after apply)
          ~ disk_type         = "pd-standard" -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS" -> (known after apply)
          ~ labels            = {} -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ machine_type      = "n1-standard-2" -> (known after apply)
          ~ metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
          + min_cpu_platform  = (known after apply)
          ~ oauth_scopes      = [
              - "https://www.googleapis.com/auth/logging.write",
              - "https://www.googleapis.com/auth/monitoring",
            ] -> (known after apply)
          ~ preemptible       = true -> (known after apply)
          ~ service_account   = "default" -> (known after apply)
          ~ tags              = [
              - "webhook",
            ] -> (known after apply)
          ~ taint             = [] -> (known after apply)

          + sandbox_config {
              + sandbox_type = (known after apply)
            }

          ~ shielded_instance_config {
              ~ enable_integrity_monitoring = true -> (known after apply)
              ~ enable_secure_boot          = false -> (known after apply)
            }

          + workload_metadata_config {
              + node_metadata = (known after apply)
            }
        }

      ~ node_pool {
          ~ initial_node_count  = 1 -> (known after apply)
          ~ instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/cosmic-surface-250108/zones/europe-west3-c/instanceGroupManagers/gke-mmk8s-cluster-default-node-pool-f1aff912-grp",
            ] -> (known after apply)
          ~ max_pods_per_node   = 110 -> (known after apply)
          ~ name                = "default-node-pool" -> (known after apply)
          + name_prefix         = (known after apply)
          ~ node_count          = 1 -> (known after apply)
          ~ node_locations      = [
              - "europe-west3-c",
            ] -> (known after apply)
          ~ version             = "1.14.10-gke.17" -> (known after apply)

          + autoscaling {
              + max_node_count = (known after apply)
              + min_node_count = (known after apply)
            }

          ~ management {
              ~ auto_repair  = true -> (known after apply)
              ~ auto_upgrade = true -> (known after apply)
            }

          ~ node_config {
              + boot_disk_kms_key = (known after apply)
              ~ disk_size_gb      = 100 -> (known after apply)
              ~ disk_type         = "pd-standard" -> (known after apply)
              ~ guest_accelerator = [] -> (known after apply)
              ~ image_type        = "COS" -> (known after apply)
              ~ labels            = {} -> (known after apply)
              ~ local_ssd_count   = 0 -> (known after apply)
              ~ machine_type      = "n1-standard-2" -> (known after apply)
              ~ metadata          = {
                  - "disable-legacy-endpoints" = "true"
                } -> (known after apply)
              + min_cpu_platform  = (known after apply)
              ~ oauth_scopes      = [
                  - "https://www.googleapis.com/auth/logging.write",
                  - "https://www.googleapis.com/auth/monitoring",
                ] -> (known after apply)
              ~ preemptible       = true -> (known after apply)
              ~ service_account   = "default" -> (known after apply)
              ~ tags              = [
                  - "webhook",
                ] -> (known after apply)
              ~ taint             = [] -> (known after apply)

              + sandbox_config {
                  + sandbox_type = (known after apply)
                }

              ~ shielded_instance_config {
                  ~ enable_integrity_monitoring = true -> (known after apply)
                  ~ enable_secure_boot          = false -> (known after apply)
                }

              + workload_metadata_config {
                  + node_metadata = (known after apply)
                }
            }

          + upgrade_settings {
              + max_surge       = (known after apply)
              + max_unavailable = (known after apply)
            }
        }

      ~ private_cluster_config {
          - enable_private_endpoint = false -> null
            enable_private_nodes    = true
            master_ipv4_cidr_block  = "172.16.0.0/28"
          ~ peering_name            = "gke-n576184e3740d04485bb-cc8c-1138-peer" -> (known after apply)
          ~ private_endpoint        = "172.16.0.2" -> (known after apply)
          ~ public_endpoint         = "35.234.110.174" -> (known after apply)
        }

        release_channel {
            channel = "STABLE"
        }
    }

  # module.gke.google_container_node_pool.primary_preemptible_nodes must be replaced
-/+ resource "google_container_node_pool" "primary_preemptible_nodes" {
        cluster             = "mmk8s-cluster"
      ~ id                  = "europe-west3-c/mmk8s-cluster/default-node-pool" -> (known after apply)
      ~ initial_node_count  = 1 -> (known after apply)
      ~ instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/cosmic-surface-250108/zones/europe-west3-c/instanceGroupManagers/gke-mmk8s-cluster-default-node-pool-f1aff912-grp",
        ] -> (known after apply)
      ~ location            = "europe-west3-c" -> "europe-west2-c" # forces replacement
      ~ max_pods_per_node   = 110 -> (known after apply)
        name                = "default-node-pool"
      + name_prefix         = (known after apply)
        node_count          = 1
      ~ project             = "cosmic-surface-250108" -> (known after apply)
      + region              = (known after apply)
      ~ version             = "1.14.10-gke.17" -> (known after apply)
      ~ zone                = "europe-west3-c" -> (known after apply)

      ~ management {
          ~ auto_repair  = true -> (known after apply)
          ~ auto_upgrade = true -> (known after apply)
        }

      ~ node_config {
          ~ disk_size_gb      = 100 -> (known after apply)
          ~ disk_type         = "pd-standard" -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS" -> (known after apply)
          ~ labels            = {} -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
            machine_type      = "n1-standard-2"
          ~ metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
            oauth_scopes      = [
                "https://www.googleapis.com/auth/logging.write",
                "https://www.googleapis.com/auth/monitoring",
            ]
            preemptible       = true
          ~ service_account   = "default" -> (known after apply)
            tags              = [
                "webhook",
            ]

          ~ shielded_instance_config {
              ~ enable_integrity_monitoring = true -> (known after apply)
              ~ enable_secure_boot          = false -> (known after apply)
            }
        }
    }

  # module.nat.google_compute_router.router must be replaced
-/+ resource "google_compute_router" "router" {
      ~ creation_timestamp = "2020-03-07T04:59:08.939-08:00" -> (known after apply)
      ~ id                 = "europe-west3/router" -> (known after apply)
        name               = "router"
        network            = "https://www.googleapis.com/compute/v1/projects/cosmic-surface-250108/global/networks/net-network"
        project            = "cosmic-surface-250108"
      ~ region             = "europe-west3" -> "europe-west2" # forces replacement
      ~ self_link          = "https://www.googleapis.com/compute/v1/projects/cosmic-surface-250108/regions/europe-west3/routers/router" -> (known after apply)

      ~ bgp {
            advertise_mode    = "DEFAULT"
          - advertised_groups = [] -> null
            asn               = 64514
        }
    }

  # module.nat.google_compute_router_nat.nat must be replaced
-/+ resource "google_compute_router_nat" "nat" {
        icmp_idle_timeout_sec              = 30
      ~ id                                 = "cosmic-surface-250108/europe-west3/router/nat-router" -> (known after apply)
      - min_ports_per_vm                   = 0 -> null
        name                               = "nat-router"
        nat_ip_allocate_option             = "AUTO_ONLY"
      - nat_ips                            = [] -> null
        project                            = "cosmic-surface-250108"
      ~ region                             = "europe-west3" -> "europe-west2" # forces replacement
        router                             = "router"
        source_subnetwork_ip_ranges_to_nat = "ALL_SUBNETWORKS_ALL_IP_RANGES"
        tcp_established_idle_timeout_sec   = 1200
        tcp_transitory_idle_timeout_sec    = 30
        udp_idle_timeout_sec               = 30

        log_config {
            enable = true
            filter = "ERRORS_ONLY"
        }
    }

  # module.nat.google_compute_subnetwork.subnet must be replaced
-/+ resource "google_compute_subnetwork" "subnet" {
      ~ creation_timestamp       = "2020-03-07T04:58:51.916-08:00" -> (known after apply)
      ~ enable_flow_logs         = false -> (known after apply)
      ~ fingerprint              = "jKWcdgWgFEg=" -> (known after apply)
      ~ gateway_address          = "10.0.0.1" -> (known after apply)
      ~ id                       = "europe-west3/k8s-subnet" -> (known after apply)
        ip_cidr_range            = "10.0.0.0/16"
        name                     = "k8s-subnet"
        network                  = "https://www.googleapis.com/compute/v1/projects/cosmic-surface-250108/global/networks/net-network"
      - private_ip_google_access = false -> null
      ~ project                  = "cosmic-surface-250108" -> (known after apply)
      ~ region                   = "europe-west3" -> "europe-west2" # forces replacement
      ~ secondary_ip_range       = [] -> (known after apply)
      ~ self_link                = "https://www.googleapis.com/compute/v1/projects/cosmic-surface-250108/regions/europe-west3/subnetworks/k8s-subnet" -> (known after apply)

      + log_config {
          + aggregation_interval = (known after apply)
          + flow_sampling        = (known after apply)
          + metadata             = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 5 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d project/cosmic-surface`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis-0:4141/lock?id=mmpyro%252Fatlantis-deployment%252Fproject%252Fcosmic-surface%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d project/cosmic-surface`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
